import { useEffect, useState } from "react";
import "./info.css";
import { Card } from "react-bootstrap";

const GameGuide = () => {
    const [lineHeight, setLineHeight] = useState(0);

    useEffect(() => {
        setLineHeight(5);
    }, []);
	return (
		<Card
			style={{ fontSize: "140%", lineHeight: "5rem" }}
			border="info"
			className="simple-single-card "
		>
			<Card.Header className="text-center">
				دانشگاه علم و صنعت ایران
			</Card.Header>
			<Card.Body className="text-right">
				<Card.Text style={{lineHeight: `${lineHeight}rem`}} className="my-5 px-5 mx-5">
					لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و
					با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه
					و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی
					تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای
					کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و
					آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم
					افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص
					طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این
					صورت می توان امید داشت که تمام و دشواری موجود در ارائه
					راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز
					شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل
					دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.لورم ایپسوم
					متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده
					از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در
					ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی
					مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی
					می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده،
					شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها
					شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان
					خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می
					توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و
					شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی
					دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود
					طراحی اساسا مورد استفاده قرار گیرد.لورم ایپسوم متن ساختگی با
					تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان
					گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و
					سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز،
					و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد،
					کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت
					فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت
					بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و
					فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان
					امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط
					سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی
					دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود
					طراحی اساسا مورد استفاده قرار گیرد.لورم ایپسوم متن ساختگی با
					تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان
					گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و
					سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز،
					و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد،
					کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت
					فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت
					بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و
					فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان
					امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط
					سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی
					دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود
					طراحی اساسا مورد استفاده قرار گیرد.لورم ایپسوم متن ساختگی با
					تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان
					گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و
					سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز،
					و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد،
					کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت
					فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت
					بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و
					فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان
					امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط
					سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی
					دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود
					طراحی اساسا مورد استفاده قرار گیرد.لورم ایپسوم متن ساختگی با
					تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان
					گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و
					سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز،
					و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد،
					کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت
					فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت
					بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و
					فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان
					امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط
					سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی
					دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود
					طراحی اساسا مورد استفاده قرار گیرد.لورم ایپسوم متن ساختگی با
					تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان
					گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و
					سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز،
					و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد،
					کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت
					فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت
					بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و
					فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان
					امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط
					سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی
					دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود
					طراحی اساسا مورد استفاده قرار گیرد.لورم ایپسوم متن ساختگی با
					تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان
					گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و
					سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز،
					و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد،
					کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت
					فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت
					بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و
					فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان
					امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط
					سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی
					دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود
					طراحی اساسا مورد استفاده قرار گیرد.لورم ایپسوم متن ساختگی با
					تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان
					گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و
					سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز،
					و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد،
					کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت
					فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت
					بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و
					فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان
					امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط
					سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی
					دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود
					طراحی اساسا مورد استفاده قرار گیرد.لورم ایپسوم متن ساختگی با
					تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان
					گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و
					سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز،
					و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد،
					کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت
					فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت
					بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و
					فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان
					امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط
					سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی
					دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود
					طراحی اساسا مورد استفاده قرار گیرد.لورم ایپسوم متن ساختگی با
					تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان
					گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و
					سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز،
					و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد،
					کتابهای زیادی در شصت و سه درصد گذشته حال و آینده،
				</Card.Text>
			</Card.Body>
		</Card>
	);
};

export default GameGuide;
